      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. MyProgram.


       PROCEDURE DIVISION.
       Main.
            DISPLAY "Hello world".
            *> Cobalt is BACK!
            DISPLAY "Hello covid".
